Rails/99cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"